# How to Read and Write JSON Files using Python and Pandas

## Let's create our own data

In [1]:
import json

data = {"Sub_ID":["1","2","3","4","5","6","7","8" ],
        "Name":["Erik", "Daniel", "Michael", "Sven",
                "Gary", "Carol","Lisa", "Elisabeth" ],
        "Salary":["723.3", "515.2", "621", "731", 
                  "844.15","558", "642.8", "732.5" ],
        "StartDate":[ "1/1/2011", "7/23/2013", "12/15/2011",
                     "6/11/2013", "3/27/2011","5/21/2012", 
                     "7/30/2013", "6/17/2014"],
        "Department":[ "IT", "Manegement", "IT", "HR", 
                      "Finance", "IT", "Manegement", "IT"],
        "Sex":[ "M", "M", "M", 
              "M", "M", "F", "F", "F"]}

print(data)

{'Sub_ID': ['1', '2', '3', '4', '5', '6', '7', '8'], 'Name': ['Erik', 'Daniel', 'Michael', 'Sven', 'Gary', 'Carol', 'Lisa', 'Elisabeth'], 'Salary': ['723.3', '515.2', '621', '731', '844.15', '558', '642.8', '732.5'], 'StartDate': ['1/1/2011', '7/23/2013', '12/15/2011', '6/11/2013', '3/27/2011', '5/21/2012', '7/30/2013', '6/17/2014'], 'Department': ['IT', 'Manegement', 'IT', 'HR', 'Finance', 'IT', 'Manegement', 'IT'], 'Sex': ['M', 'M', 'M', 'M', 'M', 'F', 'F', 'F']}

## How to save to a JSON file

In [2]:
import json
with open('data.json', 'w') as outfile:
    json.dump(data, outfile)

## How to Use Pandas to Load a JSON File

In [3]:
import pandas as pd

df = pd.read_json('data.json')
df

   Sub_ID       Name  Salary   StartDate  Department Sex
0       1       Erik  723.30    1/1/2011          IT   M
1       2     Daniel  515.20   7/23/2013  Manegement   M
2       3    Michael  621.00  12/15/2011          IT   M
3       4       Sven  731.00   6/11/2013          HR   M
4       5       Gary  844.15   3/27/2011     Finance   M
5       6      Carol  558.00   5/21/2012          IT   F
6       7       Lisa  642.80   7/30/2013  Manegement   F
7       8  Elisabeth  732.50   6/17/2014          IT   F

### Data Wrangling

In [4]:
df.set_index('Sub_ID', inplace=True)
df

             Name  Salary   StartDate  Department Sex
Sub_ID
1            Erik  723.30    1/1/2011          IT   M
2          Daniel  515.20   7/23/2013  Manegement   M
3         Michael  621.00  12/15/2011          IT   M
4            Sven  731.00   6/11/2013          HR   M
5            Gary  844.15   3/27/2011     Finance   M
6           Carol  558.00   5/21/2012          IT   F
7            Lisa  642.80   7/30/2013  Manegement   F
8       Elisabeth  732.50   6/17/2014          IT   F

## How to Export Pandas to CSV

In [5]:
df.to_csv("data.csv")

## How to Export Pandas to JSON

In [6]:
df = pd.read_csv("data.csv")

# Save dataframe to JSON format

df.to_json("data.json")

## How to Load JSON from an URL

In [7]:
url = "https://api.exchangerate-api.com/v4/latest/USD"
df = pd.read_json(url)
df.head()

    base       date  time_last_updated      rates
AED  USD 2020-02-15         1581725127   3.671931
ARS  USD 2020-02-15         1581725127  61.399228
AUD  USD 2020-02-15         1581725127   1.488200
BGN  USD 2020-02-15         1581725127   1.803753
BRL  USD 2020-02-15         1581725127   4.330496

## How to Parse Nested JSON as a String

In [8]:
nested_json = """{
   "article": [

      {
         "id":"01",
         "language": "JSON",
         "edition": "first",
         "author": "Allen"
      },

      {
         "id":"02",
         "language": "Python",
         "edition": "second",
         "author": "Aditya Sharma"
      }
   ],

   "blog":[
   {
       "name": "Datacamp",
       "URL":"datacamp.com"
   }
   ]
}"""

In [9]:
import json  
from pandas.io.json import json_normalize  

nested = json.loads(nested_json)
nested

{'article': [{'id': '01',
   'language': 'JSON',
   'edition': 'first',
   'author': 'Allen'},
  {'id': '02',
   'language': 'Python',
   'edition': 'second',
   'author': 'Aditya Sharma'}],
 'blog': [{'name': 'Datacamp', 'URL': 'datacamp.com'}]}

In [10]:
nested_full = json_normalize(nested)
nested_full

,article,blog
0,"[{'id': '01', 'language': 'JSON', 'edition': '...","[{'name': 'Datacamp', 'URL': 'datacamp.com'}]"

### Data Cleaning

We want this part only: 'blog': [{'name': 'Datacamp', 'URL': 'datacamp.com'}]

In [11]:
blog = json_normalize(nested, record_path ='blog')
blog

       name           URL
0  Datacamp  datacamp.com

In [12]:
article = json_normalize(nested, record_path ='article')
article

   id language edition         author
0  01     JSON   first          Allen
1  02   Python  second  Aditya Sharma

## How to Read a nested JSON as a File

In [14]:
nested_json = {
   "article": [

      {
         "id":"01",
         "language": "JSON",
         "edition": "first",
         "author": "Allen"
      },

      {
         "id":"02",
         "language": "Python",
         "edition": "second",
         "author": "Aditya Sharma"
      }
   ],

   "blog":[
   {
       "name": "Datacamp",
       "URL":"datacamp.com"
   }
   ]
}

In [15]:
json_file = pd.DataFrame.from_dict(json_normalize(nested_json))
json_file

,article,blog
0,"[{'id': '01', 'language': 'JSON', 'edition': '...","[{'name': 'Datacamp', 'URL': 'datacamp.com'}]"

Courtesy: DataCamp & marsja.se